{
  "topics": [
    {
      "title": "Tell me about yourself",
      "topic": "<p>My name is Alexandr Neverov. I completed a Bachelor’s degree in Radioelectronics at Odessa Maritime Academy. I managed to get a job in a company selling computers and network equipment, where I developed my career and got promoted to the position of branch manager. One of my responsibilities was the organization and promotion of an online store. That was when I got interested in web technologies and decided to make a bold career shift. </p> <p> Now I’m a full-stack developer. I completed a course at GoIT school and mastered  HTML, CSS, JavaScript, Node.js, React. I prefer to write new code at VSCode and definitely use the GitHub. I did about twenty successful projects. One of them was a website for a barbershop. </p> <p> I really want to get a job in your company, because it gives the opportunity to develop and gain invaluable experience. I’m sure that I’ll be useful for your company because I like to create sites and to solve difficult tasks. </p> <p> I understand that I have too little experience in this field, but I have a great enthusiasm to learn and work as a full-stack developer. I’m scrupulous, attentive and punctual. I'm also a fast learner. I'm sure I'll benefit from that. </p>"
    },
    {
      "title": "What do you do to improve your English?",
      "topic": "<p> About three weeks ago I started to learn English using ED Courses mobile application. It makes possible to revise the grammar and expand my vocabulary. </p> <p  > Since our lesson last Saturday and aadvice from Julia I have started to use another application called Duolingo too. It is simpler and more playful, but gives a small chance to practice speaking. I spend about an hour on the both applications every day. </p> <p  > Also I read simple books on English. I try do it every evening before going to bed. Now I'm reading “Lost world” by Arthur Conan Doyle. </p> <p  > In addition, I want to improve my listening skills and took audio lessons from Vitaliy Levental. It’s a set of dialogues on everyday topics, not very hard, but they speak in a natural way and with a natural pace. I like this course, but to my great regret I can’t donate much of time to it and study about twice a week only. </p> <p  > However, I try to learn English every day anyway, I think, I need to reconsider the lessons plan to improve my results. </p>"
    },
    {
      "title": "What is the most important to you in a job?",
      "topic": "<p  >  Two weeks ago I would have said that the most important is Job  security because it means employees don’t lose their job with a  very high probability.  </p>  <p  >But now I think differently.</p>  <p  >  Two last weeks I worked a couple of hours at night and a couple of  hours during the day and due to an emergency power outage, I  didn't know when these hours would come. I couldn't relax even at  night, couldn't properly prepare for work and study so I'm  disappointed with my results for this period.  </p>  <p  >  So I think that the employees must have sufficient time for their  own lives. I mean that harmony is needed. Time for work, time for  study, time for family and leisure, including sleep. Yin and yang.  Then their efficiency at work will be the highest. Perfect  work/life balance almost guarantees high performance at work.  </p> "
    },
    {
      "title": "What are your career development goals?",
      "topic": "<p >My main goal in my career is to get a job as a junior developer ina big IT company. To achieve this, I’m going to expand myknowledge and improve my hard and soft skills.</p><p >So, I’m taking a course in fullstack development now and I code asoften as I can. I do not only do individual projects, but teamones, too. It is so involving! I like when all team membersdistribute the tasks among themselves, deploy their best skills,brainstorm and architect the final decision.</p><p >So far, I have done two team projects and three personal ones.</p><p >Also, I find it necessary to constantly improve my English, so Istudy with a tutor, read literature in English and expand myvocabulary.</p>"
    },
    {
      "title": "Why did you leave your previous job?",
      "topic": "<p >My last job was related to copywriting and media content, which Imust upload on sites through the admin panel.</p><p >I like my last job and wonderful team, but I lost my motivation todo that job. I understood that I want not only work with websitesbut create and develop them. And in the process of JavaScriptstudying, I realized that solving such tasks is mine.</p><p >So, I want not just to change jobs, but to change the profession.</p>"
    },
    {
      "title": "What are you looking for in your next job and employer?",
      "topic": "<p >Firstly, I want to program as much as possible. It would be idealto get a lot of interesting and challenging tasks, but I also likea routine one too.</p><p >Secondly, I hope for the support of the employer in cases where I,as a beginner, can not cope with the work as quickly as anexperienced professional.</p><p >Thirdly, I would want to work with a friendly team. I treat peoplewith respect and positivity and would like reciprocity. Actually,that's usually what happens.</p>"
    },
    {
      "title": "What are your salary expectations?",
      "topic": "<p >First of all, I'm interested in getting a job in a strong team,because I want to grow constantly as a specialist. I'm open todiscussing about a fair salary for the position.</p><p >However, I know the average salary for this type of entry-levelposition is in the $600-$800 range at that moment, and I'mexpecting a salary within that range.</p><p >Again, I am willing to be flexible and open to discussing thesenumbers with you, because I'm really interested in working foryour company in this role.</p>"
    },
    {
      "title": "What are your weaknesses?",
      "topic": "<p>I love working on big projects, including in a big team. But Irealized that if my task in the project depends on the work withother colleagues I spend a lot of time checking his work.</p><p>Instead of this I have to learn to trust the professionalqualities of colleagues who are no better than me asprofessionals. This way will allow me to join forces and bring theresult closer.</p>"
    },
    {
      "title": "What are your strengths?",
      "topic": "<p>I believe that one of my strengths are punctuality and focus onresults. I have never missed a deadline at work and at studying.</p><p>Even last fall, when there were long power outages in Ukraine dueto massive missile attacks and there was no electricity in myOdessa for 18-20 hours a day, I managed to do everything necessaryon a working project and doing my homework by programming in theremaining time. I even got a compliment from Goit’s mentor aboutwriting the code and sending it in at 4 am.</p><p>I guess that this is achieved thanks to an innate ability todistribute tasks according to priorities.</p><p>P.S. It looks like I'm boast, but in fact everything said is true.</p>"
    },
    {
      "title": "Tell me about a difficult/stressful situation at your workplace",
      "topic": "<p>My current job is something like journalism. The authors write articles, the editor checks for keywords, the proofreader checks for grammatical errors, and I, as a picture editor, design and publish finished articles. All stages must go one after another, it is impossible to do in parallel.</p><p>The main difficulties in this work are related to deadlines. It often happens that you need to create an urgent article in just a couple of hours. And since my stage is the last one, sometimes there is too little time left for my part of the work. Therefore, from time to time it is necessary to ask colleagues to do faster - in the most correct, but convincing form.</p><p>Now we have a wonderful team and all our problems are solved friendly and positively. We work on the principle \"It doesn't matter who is guilty, it is important to solve the problem.\" But early were several persons who preferred to spend time looking for the weakest employee. Ironically, most often these weak employees turned out to be theyself. Such people do not take root in a close-knit team, so there are almost no stressful situations at my work now. Just specific working moments.</p>"
    },
    {
      "title": "Tell about your biggest mistake at work",
      "topic": "<p>My biggest mistake at work was connected with copyright of photo. It happened about ten years ago. I decorated the article using photos from social networks. A few years later there was a law about using photos from social networks only with consent oh the author or with help of a widget. That article was old and nobody redo it. And the author of the photo wanted to sued and we had to pay a decent fine.</p><p>It was painful for me not only from a material point of view, but also morally, because I did not want to offend anyone. And I still feel embarrassed and ashamed of that incident.</p><p>But this mistake taught me to take a responsible approach to the contents - as to the property of a person. After that, I always indicate the owner of the photo or the source from where it was received.</p>"
    }
  ]
}
