{
  "topics": [
    {
      "id": 1,
      "title": "Tell me about yourself",
      "text": "My name is Alexandr Neverov. I completed a Bachelor’s degree in Radioelectronics at Odessa Maritime Academy. I managed to get a job in a company selling computers and network equipment, where I developed my career and got promoted to the position of branch manager and content manager. One of my responsibilities was the organization and promotion of an online store. That was when I got interested in web technologies and decided to make a bold career shift.\nNow I’m a full-stack developer. I completed a course at GoIT school and mastered HTML, CSS, JavaScript, React and Node.js. I prefer to write new code at VSCode and definitely use the GitHub. I did about twenty successful projects. One of them was a my personal Music Library with frontend and backend parts.\n And I don't stop in my learning. Now, for example, I started learning TypeScript, then I plan to learn NestJS in order to study the backend in depth.\nAnd I really want to get a job in your company, because it gives the opportunity to develop and gain invaluable experience. I’m sure that I’ll be useful for your company because I like to create sites and to solve difficult tasks.\nI understand that I have no commercial experience, but I have a great enthusiasm to learn and work as a full-stack developer. I’m scrupulous, attentive and punctual. I'm also a fast learner. I'm sure I'll benefit from that."
    },
    {
      "id": 2,
      "title": "What do you do to improve your English?",
      "text": "About three weeks ago I started to learn English using ED Courses mobile application. It makes possible to revise the grammar and expand my vocabulary.\nSince our lesson last Saturday and aadvice from Julia I have started to use another application called Duolingo too. It is simpler and more playful, but gives a small chance to practice speaking. I spend about an hour on the both applications every day.\nAlso I read simple books on English. I try do it every evening before going to bed. Now I'm reading “Lost world” by Arthur Conan Doyle.\nIn addition, I want to improve my listening skills and took audio lessons from Vitaliy Levental. It’s a set of dialogues on everyday topics, not very hard, but they speak in a natural way and with a natural pace. I like this course, but to my great regret I can’t donate much of time to it and study about twice a week only.\nHowever, I try to learn English every day anyway, I think, I need to reconsider the lessons plan to improve my results."
    },
    {
      "id": 3,
      "title": "What is the most important to you in a job?",
      "text": "Before the war I would have said that the most important is Job  security because it means employees don’t lose their job with a very high probability.\nBut now I think differently.\nAt last autumn and winter I worked a couple of hours at night and a couple of  hours during the day and due to an emergency power outage, I  didn't know when these hours would come. I couldn't relax even at  night, couldn't properly prepare for work and study so I was  disappointed with my results for this period.\nSo I think that the employees must have sufficient time for their own lives. I mean that harmony is needed. Time for work, time for  study, time for family and leisure, including sleep. Yin and yang. Then their efficiency at work will be the highest. Perfect work/life balance almost guarantees high performance at work."
    },
    {
      "id": 4,
      "title": "What are your career development goals?",
      "text": "My main goal in my career is to get a job as a junior developer ina big IT company. To achieve this, I’m going to expand myknowledge and improve my hard and soft skills.\nSo, I took a course in fullstack development and I don't stop in my learning. Now, for example, I started learning TypeScript, then I plan to learn NestJS in order to study the backend in depth.\nI code as often as I can. I do not only do individual projects, but team ones, too. It is so involving! I like when all team members distribute the tasks among themselves, deploy their best skills, brainstorm and architect the final decision.\nSo far, I have done two team projects and three personal ones.\nAlso, I find it necessary to constantly improve my English, so I study with a tutor, read literature in English and expand my vocabulary.I also plan to take an in-depth English course in specialized courses in the near future."
    },
    {
      "id": 5,
      "title": "Why did you leave your previous job?",
      "text": "My last job was related to copywriting and media content, which I must upload on sites through the admin panel.\nI like my last job and realy wonderful team, but I lost my motivation to do that job. I understood that I want not only work with websites but create and develop them. And in the process of JavaScript and Node.js studying, I realized that solving such tasks is mine.\nSo, I want not just to change jobs, but to change the profession."
    },
    {
      "id": 6,
      "title": "What are you looking for in your next job and employer?",
      "text": "Firstly, I want to program as much as possible. It would be ideal to get a lot of interesting and challenging tasks, but I also like a routine one too.\nSecondly, I hope for the support of the employer in cases where I, as a beginner, can not cope with the work as quickly as an experienced professional.\nThirdly, I would want to work with a friendly team. I treat people with respect and positivity and would like reciprocity. Actually, that's usually what happens."
    },
    {
      "id": 7,
      "title": "What are your salary expectations?",
      "text": "First of all, I'm interested in getting a job in a strong team, because I want to grow constantly as a specialist. I'm open to discussing about a fair salary for the position.\nHowever, I know the average salary for this type of entry-level position is in the $600-$800 range at that moment, and I'm expecting a salary within that range.\nAgain, I am willing to be flexible and open to discussing these numbers with you, because I'm really interested in working for your company in this role."
    },

    {
      "id": 8,
      "title": "What are your weaknesses?",
      "text": "I love working on big projects, including in a big team. But I realized that if my task in the project depends on the work with other colleagues I spend a lot of time checking his work.\nInstead of this I have to learn to trust the professional qualities of colleagues who are no worse than me as professionals. This way will allow me to join forces and bring the result closer."
    },
    {
      "id": 9,
      "title": "What are your strengths?",
      "text": "I believe that one of my strengths are punctuality and focus on results. I have never missed a deadline at work and at studying.\nEven last fall, when there were long power outages in Ukraine due to massive missile attacks and there was no electricity in my Odessa for 18-20 hours a day, I managed to do everything necessary on a working project and doing my homework by programming in the remaining time. I even got a compliment from Goit’s mentor about writing the code and sending it in at 4 am.\nI guess that this is achieved thanks to an innate ability to distribute tasks according to priorities.\nP.S. It looks like I'm boast, but in fact everything said is true."
    },
    {
      "id": 10,
      "title": "May we contact your previous employers?",
      "text": "Of course, I don't see a problem with that. I have had great relationships with all my previous employers. Unfortunately, they won't be able to confirm my technical skills as a developer. But I am confident that they can tell about my soft skills and professional attitude towards work."
    },
    {
      "id": 11,
      "title": "Tell me about a difficult/stressful situation at your workplace",
      "text": "My current job is something like journalism. The authors write articles, the editor checks for keywords, the proofreader checks for grammatical errors, and I, as a picture editor, design and publish finished articles. All stages must go one after another, it is impossible to do in parallel.\nThe main difficulties in this work are related to deadlines. It often happens that you need to create an urgent article in just a couple of hours. And since my stage is the last one, sometimes there is too little time left for my part of the work. Therefore, from time to time it is necessary to ask colleagues to do faster - in the most correct, but convincing form.\nNow we have a wonderful team and all our problems are solved friendly and positively. We work on the principle \"It doesn't matter who is guilty, it is important to solve the problem.\" But early were several persons who preferred to spend time looking for the weakest employee. Ironically, most often these weak employees turned out to be theyself. Such people do not take root in a close-knit team, so there are almost no stressful situations at my work now. Just specific working moments."
    },
    {
      "id": 12,
      "title": "Tell about your biggest mistake at work",
      "text": "My biggest mistake at work was connected with the copyright of photo. It happened about ten years ago. I decorated the article using photos from social networks. A few years later there was a law about using photos from social networks only with the consent oh the author or with help of a the widget. That article was old and nobody redo it. And the author of the photo wanted to sued and we had to pay a decent fine.\nIt was painful for me not only from a material point of view, but also morally, because I did not want to offend anyone. And I still feel embarrassed and ashamed of that incident.\nBut this mistake taught me to take a responsible approach to the contents - as to the property of a person. After that, I always indicate the owner of the photo or the source from where it was received."
    },
    {
      "id": 13,
      "title": "What questions would you ask your employer?",
      "text": "I have two questions. At first: How do you currently support or mentor junior developers? And second: In case of the beginning of our cooperation with you, will it not be a problem if I have to work for 14 days at the previous place?"
    },
    {
      "id": 14,
      "title": "Thank-you letter",
      "text": "Thank you for the opportunity to interview for the junior developer role. I appreciated our discussion about beginner level of developer, and your oppoint on switchers was importent. I am genuinely excited about joining your company, and I believe my enthusiasm and aspirations aligns well with the position./nI look forward to hearing from you soon and discussing the next steps. Thank you again for your time and consideration. /nYours respectfully,/nAlex NeverOff"
    },

    {
      "id": 15,
      "title": "What is the most unacceptable for you at work",
      "text": "The most unacceptable at work for me is the disrespectful attitude in the team, especially from the management. In my opinion, in such a team there will be toxic relationships and the result cannot be adequate."
    }
  ]
}
